src/main/java/com/lld/problems/library/notes/notes.md
```mermaid
sequenceDiagram
    participant Main
    participant Library
    participant Transaction

    Main->>Library: borrowBook(rentalType, userId, bookId)
    Library->>Library: getUser(userId)
    alt user not found
        Library-->>Main: throws UserNotFoundException
    end
    Library->>Library: passValidation(user)
    alt pass expired
        Library-->>Main: throws PassExpiredException
    end
    Library->>Library: getBook(bookId)
    alt book not found
        Library-->>Main: throws BookNotFoundException
    end
    Library->>Library: getBookItem(book)
    alt no available bookItem
        Library-->>Main: throws BookUnAvailableException
    end
    Library->>Library: borrowLimitValidation(user)
    alt currBookHeld >= maxBooksAllowed
        Library-->>Main: throws BorrowLimitExceedsException
    end
    Library->>Transaction: new(paymentService)
    Library->>Transaction: recordBorrowBook(rentalType, bookItem)
    Transaction-->>Library: Receipt
    Library->>Library: updateBookItemStatus(ALLOCATE, bookItemId)
    Library->>Library: user.updateCurrentBooksHeld(1)
    Library-->>Main: Receipt
```
